In [95]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [96]:
df_29 = pd.read_csv("http://web.mta.info/developers/data/nyct/turnstile/turnstile_190629.txt")
df_22 = pd.read_csv("http://web.mta.info/developers/data/nyct/turnstile/turnstile_190622.txt")
df_15 = pd.read_csv("http://web.mta.info/developers/data/nyct/turnstile/turnstile_190615.txt")
df_8 = pd.read_csv("http://web.mta.info/developers/data/nyct/turnstile/turnstile_190608.txt")
df_1 = pd.read_csv("http://web.mta.info/developers/data/nyct/turnstile/turnstile_190601.txt")

In [1]:
df = df_1
df = df.append(df_8)
df = df.append(df_15)
df = df.append(df_22)
df = df.append(df_29)
df.head()

NameError: name 'df_1' is not defined

In [90]:
df['DATE'] = pd.to_datetime(df['DATE'])
df.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,2019-05-25,00:00:00,REGULAR,7071830,2396411
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,2019-05-25,04:00:00,REGULAR,7071844,2396415
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,2019-05-25,08:00:00,REGULAR,7071864,2396443
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,2019-05-25,12:00:00,REGULAR,7071943,2396500
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,2019-05-25,16:00:00,REGULAR,7072182,2396555

In [91]:
df.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,2019-05-25,00:00:00,REGULAR,7071830,2396411
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,2019-05-25,04:00:00,REGULAR,7071844,2396415
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,2019-05-25,08:00:00,REGULAR,7071864,2396443
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,2019-05-25,12:00:00,REGULAR,7071943,2396500
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,2019-05-25,16:00:00,REGULAR,7072182,2396555

In [50]:
dfz = pd.DataFrame({
    'a': [1, 2, 3, 4],
    'b': [1, 2, 4, 8],
    'c': [2, 10, 30, 100]
})
z = list(dfz.c.diff())
z

[nan, 8.0, 20.0, 70.0]

<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>

In [42]:
# compost heap
df.iloc[0][9]

7071830

In [2]:
import pandas as pd
import numpy as np
from datetime import datetime, date, timedelta

date_start = date(2019,6,1)
date_end = date(2019,6,29)
num_days = (date_end - date_start).days
first_url = ('http://web.mta.info/developers/data/nyct/turnstile/turnstile_' + (date_start).strftime('%y%m%d') + '.txt')
# print(first_url)

df = pd.read_csv(first_url)
if num_days > 6:
    for i in range(num_days+1)[7::7]:
        url=('http://web.mta.info/developers/data/nyct/turnstile/turnstile_'+ (date_start+timedelta(days=i)).strftime('%y%m%d') + '.txt')
        print(url)
        df = df.append(pd.read_csv(url), ignore_index=True)

# Collapse

http://web.mta.info/developers/data/nyct/turnstile/turnstile_190608.txt
http://web.mta.info/developers/data/nyct/turnstile/turnstile_190615.txt
http://web.mta.info/developers/data/nyct/turnstile/turnstile_190622.txt
http://web.mta.info/developers/data/nyct/turnstile/turnstile_190629.txt

In [112]:
range(num_days)[7::7]

range(7, 28, 7)